tutorials/MRFSimpleFoam/mixerVessel2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "..";
    case "mixerVessel2D";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
rotor
{
    type wall;
    nFaces 192;
    startFace 5952;
}

stator
{
    type wall;
    nFaces 192;
    startFace 6144;
}

front
{
    type empty;
    nFaces 3072;
    startFace 6336;
}

back
{
    type empty;
    nFaces 3072;
    startFace 9408;
}
)

// ************************************************************************* //
